{
  "@moofy-bot your commands": "opens this\n\nmention + `help`/`(your|ur)commands`/`commandformat`",
  "who's @moofy-bot": "opens the about thingy\n\nmention + `who`",
  "hate": "trigger the bot\n\n`[hate|hated|hates|hating|hatred|hater|haters]`",
  "pagination test": "a pagination test; the demo lets you select a word for it to spell out. this was the first command made for variant `giggle-bot`\n\n`pag[e|ination]test`",
  "use this channel": "sets the channel for where an external echo should go\n\n`usethischannel`",
  "echo(c)(x)(s)(e): message": "sends what you sent.\n**flags**\nc - put the message in a code block\nx - sends the message to a different channel set by the `use this channel` command\ns - doesn't trim the whitespace after the colon\ne - puts the message in an embed (something that only bots can post)\n\n`echo(c)(x)(s)(e):` (there must be at least a non-whitespace character after the colon)",
  "dumb bot": "trigger the bot\n\n`dumb` + `bot`",
  "should've": "learn proper grammar\n\n`[could|might|should|will|would]['ve| have]",
  "@moofy-bot delete 10": "takes the 10 latest messages and deletes the ones that are from the bot\n\nmention + `delete[<nonnegative number>]`",
  "@moofy-bot react [emoji]": "reacts the emoji (unless it's a custom one, or if it's thumbs up/down) on a message. you can set the message by reacting TREE on it (for some reason it doesn't work if the message existed before the bot restarted)\n\nmention + `react[<emoji>]` (only unicode (not custom) emojis that are supported on Discord are allowed; the bot doesn't know if the reaction works, so don't be suprised if nothing appears; it might just be unsupported)",
  "inspect emoji": "opens up an emoji inspector that inspects the emoji from a reaction\n\n`inspectemoji`",
  "pick a random number between 1 and 10": "picks a number between the given range\n\n`(pick)(a)rand(om)num(ber)(d'|from|between)[<nonnegative integer>](-|to|t'|&|and|n')[<nonnegative integer>]`",
  "actually pick a random number between 1 and 10": "picks a *random* number between the given range\n\n`actually(pick)(a)rand(om)num(ber)(d'|from|between)[<nonnegative integer>](-|to|t'|&|and|n')[<nonnegative integer>]`",
  "my bcbw": "tells you how much bitcoin but worse (BCBW) you have\n\n`my[money|bcbw]`",
  "@person's bcbw": "tells you how much bitcoin but worse (BCBW) the given person has\n\n`[<user mention>]('s)[money|bcbw]`",
  "my name is Bob": "sets your nickname to Bob so that in the future it doesn't mention spam you whenever someone else wants to know how much money you have or whatever\n\n`myname('s|is) [<name>]` (the rest of the message will be part of your name)",
  "give @person 123 bcbw": "gives the bitcoin but worse (BCBW) to the given person\n\n`give[<user mention>][<nonnegative integer>][money|bcbw]`",
  "moofy market": "opens the market\n\nmention + `market`",
  "my inventory": "shows you your inventory's contents\n\n`myinv(entory)`",
  "@person's inventory": "shows you the given person's inventory's contents\n\n`[<user mention>]('s)inv(entory)`",
  "my daily": "get your daily `500` bitcoin but worse (BCBW)\n\n`mydaily`",
  "I want to mine": "makes you mine and earn some bitcoin but worse (BCBW). requires a pickaxe. we cannot guarantee the survival of the pickaxe\n\n`iwanttomine`",
  "@moofy-bot GAME": "starts a game with moofy-bot that can earn you some bitcoin but worse (BCBW)\n\n`hint 3` allows you to buy the third letter\n`cancel` cancels the game\n\nmention + `GAME` (it must be in all caps)",
  "@moofy-bot profiles": "lists profiles that have a bitcoin but worse (BCBW) account\n\nmention + `profiles`",
  "@moofy-bot leaderboard": "lists the people with the most bitcoin but worse (BCBW)\n\nmention + `leader(board)`",
  "exchange 1000 bcbw to democoin": "converts the given amount of bitcoin but worse (BCBW) to DemoCoin\n\n`[exchange|convert][<nonnegative integer>][to|2][democoin|dc]`",
  "@moofy-bot tell me more about command #1": "searchs the command help list and gives the nth result\n\nmention + `tellmemoreabout[<query>]((#)[<nonnegative integer>])` (the query can only consist of the letters a to z; 1-indexed result number)",
  "rob from @person": "starts a robbery. while you are robbing, you can't rob more people, and people are able to take up to 4000 bitcoin but worse (BCBW) from you if they catch you. the person must be in the server\n\n`[rob|steal](from|d')[<user mention>]",
  "HEY": "catches robbers if there are any. does not work for bank robberies\n\n`HEY` (case sensitive)",
  "myprogress": "when robbing, it tells you how much bitcoin but worse (BCBW) you would steal if you run the `run` command. otherwise, it just outputs a list of current robberies for debug purposes.\n\n`myprogress`",
  "run": "when robbing, it transfers the stolen bitcoin but worse (BCBW) to your account, and people can't catch you anymore\n\n`run`",
  "put 123 bcbw in the bank": "gives the given amount of bitcoin but worse (BCBW) to your virtual bank account. you can't use money while it is in the bank. robbers can't steal bitcoin but worse (BCBW) that is in the bank.\n\n`put[<nonnegative integer>](money|bcbw)(the|l')inbank`",
  "take 123 money from the bank": "takes the given amount of bitcoin but worse (BCBW) from the bank so you can use it. however, the bank charges a small fee as payment for their protection.\n\n`take[<nonnegative integer>](money|bcbw)[from|d'](the|l')bank`",
  "my bank account": "outputs the bitcoin but worse (BCBW) in your account.\n\n`mybankacc(ount)`",
  "drink ☕": "consumes the given item. some items can't be eaten. some items have a special effect when eaten. the emoji version of the item must be given (not the name)\n\n`[consume|drink|eat][<emoji item>]` (only unicode (not custom) emojis that are supported on Discord are allowed)",
  "moofy, buy 2 ☕": "buys the given quantity of given item. it's the shortcut version of the `moofy market` command. the bot doesn't ask for confirmation.\n\nmention + `buy[<nonnegative integer>][<emoji item>]`",
  "rob the bank": "starts a robbery of the bank. similar rules to `rob from @person`, but you risk getting banned from the bank (with your money trapped in the bank) if you are caught. fortunately, people can't just say `HEY`; they have to `attack` you first.\n\n`rob(the|l')bank`",
  "attack": "attacks a random robber using a gun and consumes the gun. if the robber has a gun, they lose it but can continue robbing. however, if they do not have a gun, they get caught.\n\n`attack`"
}
